window.onload = function () {
  let sections = $('section');
  // for(let i=0;i<sections.length;i++){
  //   sections[i].style.width = "640px";
  //   sections[i].style.height = "1008px";
  //   sections[i].style.position = "absolute";
  // }
  let secs = {
    sec1:sections[0],
    sec2:sections[1]
  };
  //home点击
  $('#igo').bind('touchstart',function(){
    secs.sec1.style.animation = 'igo 0.3s linear forwards';
    secs.sec2.style.display = 'none';
    clear([secs.sec1]);
  });
  //倒计时开始
  $('#go').bind('touchstart',function(){
    $(secs.sec2).children(".curtain").css("display","block");
    $("#countdown").css('animation','num 1s linear infinite');
    goTime(3,$(secs.sec2));
  });
  //题目集合
  var topic = [
    '板材家具，会变成“短命家居”吗？',
    '板材的气味是否会有害？',
    '以下哪个一个板材环保等级环保指数比较高？',
    '定制衣柜高度过高容易对侧板造成压力从而引发变形，并减少衣柜的寿命，这说法正确吗？',
    '实木衣柜的特点除了经久耐用、造型精美、风格不限之外还有什么优点呢？',
    '衣柜用久了，有异味，除了可以放置橘子皮、香皂、用香水之外，还可以放置什么东西除味呢？',
    '实木家居黄金含水率控制在多少左右？',
    '甲醇本身是有气味的吗？',
    '夏季天气炎热，是否会加剧甲醛释放？',
    '定制衣柜什么时候量尺寸？',
    '吸湿盒可以帮助实木家具防潮吗？',
    '玛格的实木来自于哪里呢？'
  ];
  var answer = {
    t1:['A、会','B、不会'],
    t2:['A、会','B、不会'],
    t3:['A、E1','B、E0','C、F4★★★★'],
    t4:['A、正确','B、不正确'],
    t5:['A、健康环保','B、耐磨','C、好看'],
    t6:['A、杯子','B、竹炭挂包','C、风油精'],
    t7:['A、8%-12%','B、10%-12%','C、12%-15%'],
    t8:['A、有','B、没有'],
    t9:['A、会','B、不会'],
    t10:['A、吊顶做好和地面找平之后','B、吊顶做好和地面找平之前'],
    t11:['A、可以','B、不可以'],
    t12:['A、国内','B、南极','C、北美'],
  };
  var promptText = [
      '最近几年国家发力淘汰落后产能，板材行业技术升级，让板材的质量和使用寿命都上一个全新的台阶。',
      '板材本身就是采用多种木材加工而成，天然带有不同木头的味道， 从健康的角度来说，对人体是无害的。',
      'F★★★★级甲醛释放量≤0.3mg/LE0级甲醛释放量≤0.5mg/L E1级甲醛释放量≤1.5mg/L',
      '只要选择正规品牌定制衣柜，加上优质的板材，几乎不会出现这种问题。',
      '实木衣柜因其避免过多地使用一些粘合剂，在健康环保性能上面更加优越。',
      '将竹炭挂包放入衣柜，可以吸附衣服的异味，同时还可以防潮、杀菌、驱虫。',
      '木材的含水率在8%-12%时，保证了家具使用的稳定性，延长了使用寿命，不易开裂变形，增加了木材的硬度。',
      '甲醛本身只有刺激性，是没有气味的，因此定制家具散发出异味，不等于甲醛超标。',
      '只要产品符合相应的环保标准，即便是到了夏天，一般也不会出现由于甲醛释放加剧引起室内甲醛超标的情况。',
      '定制衣柜的测量需要尺寸比较精确。通常需要家里的木工吊顶或者石膏吊顶做好和地面找平之后。',
      '衣柜除湿必备。市面上比较常见的吸湿用品，集除湿、芳香、抗霉、除臭等功能于一体。',
      '玛格的实木全部严选来自北美的杉木，每棵树龄都有60年以上，强度更高、韧性更足。'
  ];
  var t = [1,1,2,0,0,1,0,1,1,0,0,2];
  var status = {
    state:1,//当前处于第几题题目
    t:0//答对的题目数量
  }













  var btn = $('#btn');
  btn.bind('touchstart',function(){

  });
}





















